app/controllers/campaigns_controller.rb

    scope = Campaign.where(:archived => false)
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`archived` = 0

  def show
    ip = request.remote_ip
    if ENV['RAILS_ENV'] == 'development'
       ip = '103.15.140.69'
      # ip = '125.26.112.3'
    end
    @ip_timezone = Campaign.check_timezone(ip)
    @metro_codes_recent, @metro_codes_not_recent = @campaign.all_metro_codes_partition
    @org_other_data = @campaign.filter_organization_other.present? ? @campaign.filter_organization_other.split(",").map{|o| {id:o, name:o.capitalize}} : {}
---
SELECT `geocode_metro_codes`.* FROM `geocode_metro_codes` ORDER BY metro_name

  def update
    # in case it wasn't set at all
    if ((params[:campaign][:ip_timezone].present?) && params[:campaign][:browser_timezone].present? )
      if(params[:campaign][:ip_timezone].downcase == params[:campaign][:browser_timezone].downcase)
        @campaign.update_attributes(match_timezone: true)
---
UPDATE `campaigns` SET `safe_lp` = 'http://localhost:3000/campaigns', `real_lp` = 'http://localhost:3000/hits', `mail_services` = '', `geocode_metro_code_list` = '' WHERE `campaigns`.`id` = 4