app/controllers/hit_counts_controller.rb

SELECT `hit_counts`.* FROM `hit_counts` ORDER BY hits_total DESC LIMIT 100
---
  def index
    @hit_counts = HitCount.includes(:user_agent).order("hits_total DESC").limit(100)