app/controllers/hit_stats_controller.rb

  def index
    # select ip, campaign_id, hits from hit_stats order by ip, hits;
    # select ip, sum(hits) hits from hit_stats group by ip order by hits;
    @hit_stats = HitStat.order('ip, hits').all
---
SELECT ip, sum(hits) hits FROM `hit_stats` GROUP BY ip ORDER BY hits