app/controllers/hits_controller.rb

SELECT `hits`.* FROM `hits` ORDER BY created_at desc, passed desc LIMIT 100
---
  def index
    @hits = Hit.order('created_at desc, passed desc').limit(100)

SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`sha1` = '7e11543eadda52b5b501ce66d3dec9bf9c4a5439' AND `campaigns`.`archived` = 0 LIMIT 1
---
  def create
    sha1 = params[:sha1] || params[:h] || params[:id]
    puts("request#{request.inspect}")
    session[:req] = request.fullpath.to_s
    session[:ref] = request.referrer || ''
    @campaign = Campaign.cache_it.find(:sha1 => sha1, :archived => false) if sha1