app/controllers/trackers_controller.rb

INSERT INTO `trackers` (`domain`, `ip`) VALUES ('http://localhost:3000', '127.0.0.1')
---
  def create
    @tracker = Tracker.new(params[:tracker])
    if @tracker.save