app/views/campaigns/index.html.erb

      </td>
      <td style="vertical-align:middle;"><nobr><%= campaign.hits.last ? formatted(campaign.hits.last.created_at) : "None" %></nobr></td>
---
SELECT `hits`.* FROM `hits` WHERE (`hits`.campaign_id = 1) ORDER BY hits.id DESC LIMIT 1