app/views/campaigns/show.html.erb

      <div class="span5">
        <% options = Tracker.domains_with_usage.map{|domain, usage| ["#{domain} (#{usage})", domain]} %>
---
SELECT `trackers`.* FROM `trackers`